OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pimpleFoam/RAS/wingMotion_backup/wingMotion2D_pimpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            noSlip;
    }

    top
    {
        type            slip;
    }
     bottom
    {
        type            slip;
    }
    
    front_back
    {
        type            empty;
    }
}


// ************************************************************************* //
