OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pimpleFoam/RAS/wingMotion_backup/wingMotion2D_pimpleFoam/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
		type            solidBodyMotionDisplacement;
		solidBodyMotionFunction oscillatingLinearMotion;
		oscillatingLinearMotionCoeffs
		{
			amplitude (0 0.02 0);
			omega 31.5; // [rad/s]
		}    
    }

    front_back
    {
        type            empty;
    }

    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
